### Start with understanding the data

In [30]:
import pandas as pd

In [31]:
df1 = pd.read_excel("./mexico-real-estate.xlsx")
df2 = pd.read_excel("./mexico-real-estate2.xlsx")
df3 = pd.read_excel("./mexico-real-estate3.xlsx")

In [32]:
df1.shape

(700, 6)

In [33]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 32.9+ KB

In [34]:
df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

#### Dealing with df1

In [35]:
# Remove "Nan" values
df1.dropna(inplace=True)
# df1 = df1.dropna() #This creates a new dataFrame

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 31.9+ KB

In [37]:
# Remove String values (if mixed with numeric values) from a column
df1["price_usd"].head()

0     $67,965.56
1     $63,223.78
2     $84,298.37
3     $94,308.80
5    $105,191.37
Name: price_usd, dtype: object

In [38]:
df1["price_usd"]=(df1["price_usd"]
                  .str  #This is pandas inbuilt function to allow string methods to the elements of a pandas series
                  .replace("$",""). # Replace is simply a string operation
                  str.replace(",","").
                  astype(float))    # astype is also an pandas inbuilt function to convert type of the complete dataframe or a series
df1.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
5         house           Yucatán  21.052583  -89.538639      205  105191.37

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.9+ KB

#### Dealing with df2

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

In [41]:
df2.head()

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581       72    1300000
1     apartment      Puebla        NaN         NaN      190    2500000
2         house     Morelos  23.634501 -102.552788      360    5300000
3         house     Morelos        NaN         NaN       76     820000
4         house      Puebla        NaN         NaN      200    1100000

In [42]:
df2.dropna(inplace=True)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 571 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  571 non-null    object
 1   state          571 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        571 non-null    int64
 5   price_mxn      571 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 31.2+ KB

In [43]:
# Operations on a column in pandas

df2["price_usd"] = (df2["price_mxn"]/19).round(2)
df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72,1300000,68421.05
2,house,Morelos,23.634501,-102.552788,360,5300000,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85,1250000,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158,2120000,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65,758190,39904.74

In [44]:
# Remove column from pandas (drop)
df2.drop(columns=["price_mxn"], inplace=True)

In [45]:
df2

    property_type             state        lat         lon  area_m2  price_usd
0       apartment        Nuevo León  25.721081 -100.345581       72   68421.05
2           house           Morelos  23.634501 -102.552788      360  278947.37
6       apartment  Estado de México  19.272040  -99.572013       85   65789.47
7           house   San Luis Potosí  22.138882 -100.996510      158  111578.95
8       apartment  Distrito Federal  19.394558  -99.129707       65   39904.74
..            ...               ...        ...         ...      ...        ...
695         house           Morelos  18.917542  -98.963181      140   76315.79
696         house  Distrito Federal  19.472128  -99.146697      190  102263.16
697         house  Estado de México  19.234984  -99.558175      115  110526.32
698         house            Puebla  18.918714  -98.426639       90   46842.11
699         house           Yucatán  21.075163  -89.516731      185   89210.53

[571 rows x 6 columns]

#### Dealing with df3

In [46]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.5+ KB

In [47]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67

In [48]:
df3.dropna(inplace=True)

In [49]:
df3["lat-lon"].head(2)

0       19.52589,-99.151703
1    19.2640539,-99.5727534
Name: lat-lon, dtype: object

In [50]:
df3["lat-lon"].str.split(",").head(2)

0       [19.52589, -99.151703]
1    [19.2640539, -99.5727534]
Name: lat-lon, dtype: object

In [51]:
df3["lat-lon"].str.split(",",expand=True).head(2)

            0            1
0    19.52589   -99.151703
1  19.2640539  -99.5727534

In [52]:
df3[["lat","lon"]] = df3["lat-lon"].str.split(",",expand=True)
df3.head(2)

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534

In [53]:
temp_df = df3["place_with_parent_names"].str.split("|",expand=True)
temp_df.head(2)

,0,1,2,3,4,5,6
0,,México,Distrito Federal,Gustavo A. Madero,Acueducto de Guadalupe,,None
1,,México,Estado de México,Toluca,Metepec,,None

In [54]:
temp_df[2].head(2)

0    Distrito Federal
1    Estado de México
Name: 2, dtype: object

In [55]:
df3["state"] = temp_df[2]
df3.drop(columns=["place_with_parent_names","lat-lon"], inplace=True)
df3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,house,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,175,102763.00,20.689157,-103.366728,Jalisco

#### Concatenating the DataFrames

In [56]:
# When we are concatenating DataFrames side by side, it is called axis 1. 
# If we are appending them one below the other, then it is called axis 0.

In [57]:
df = pd.concat([df1,df2,df3], ignore_index=True)
print(df.shape)

(1736, 6)

#### Saving the DataFrame into a csv

In [58]:
df.to_csv("mexico-real-estate-clean.csv", index=None)